Crypto_Wallet/lib/tasks/dev.rake

      ]

      coins.each do |coin|
          Coin.find_or_create_by!(coin)
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  task add_mining_types: :environment do
    show_spinner("Cadastrando tipo de mineração...") do
      mining_types = [
        {name: "Proof of Work", acronym: "PoW"},
        {name: "Proof of Stake", acronym: "PoS"},
        {name: "Proof of Capacity", acronym: "PoC"}
      ]

      mining_types.each do |mining_types|
        MiningType.find_or_create_by!(mining_types)
---
INSERT INTO "mining_types" ("name", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2021-05-24 09:40:10.073704"], ["updated_at", "2021-05-24 09:40:10.073704"]]