Crypto_Wallet/app/controllers/coins_controller.rb

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://pngimg.com/uploads/bitcoin/bitcoin_PNG47.png"], ["updated_at", "2021-05-21 06:56:00.852497"], ["id", 1]]